In [15]:
import pandas as pd
data={
    "id_producto": [1, 2, 1, 4, 5],
    "nombre_producto":["manzana", "Pera", "platano", "naranja", "uva"],
    "precio":[50.5, None, 18.75, 25.0, None],
    "cantidad":[None,50, None,20,30],
}
df = pd.DataFrame(data)
df

   id_producto nombre_producto  precio  cantidad
0            1         manzana   50.50       NaN
1            2            Pera     NaN      50.0
2            1         platano   18.75       NaN
3            4         naranja   25.00      20.0
4            5             uva     NaN      30.0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id_producto      5 non-null      int64
 1   nombre_producto  5 non-null      object
 2   precio           3 non-null      float64
 3   cantidad         3 non-null      float64
dtypes: float64(2), int64(1), object(1)
memory usage: 292.0+ bytes

In [17]:
df.isnull().sum()

id_producto        0
nombre_producto    0
precio             2
cantidad           2
dtype: int64

In [18]:
dfLimpio = df.dropna()
dfLimpio

   id_producto nombre_producto  precio  cantidad
3            4         naranja    25.0      20.0

In [19]:
dfRellanado= df.fillna({"precio":df["precio"].mean(), "cantidad": 0})
dfRellanado

   id_producto nombre_producto     precio  cantidad
0            1         manzana  50.500000       0.0
1            2            Pera  31.416667      50.0
2            1         platano  18.750000       0.0
3            4         naranja  25.000000      20.0
4            5             uva  31.416667      30.0

In [20]:
df_unicos = dfRellanado.drop_duplicates(subset="id_producto")
df_unicos

   id_producto nombre_producto     precio  cantidad
0            1         manzana  50.500000       0.0
1            2            Pera  31.416667      50.0
3            4         naranja  25.000000      20.0
4            5             uva  31.416667      30.0